In [27]:
# SQL queries

-- Create a table rentals_may to store the data from rental table with information for the month of May.
USE sakila;

DROP TABLE IF EXISTS rentals_may;

CREATE TABLE rentals_may (
    `rental_id` INT NOT NULL,
    `rental_date` DATETIME NOT NULL,
    `inventory_id` MEDIUMINT UNSIGNED NOT NULL,
    `customer_id` SMALLINT UNSIGNED NOT NULL,
    `return_date` DATETIME DEFAULT NULL,
    `staff_id` TINYINT NOT NULL,
    `last_update` TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    CONSTRAINT PRIMARY KEY (`rental_id`)
);

-- Insert values in the table rentals_may using the table rental, filtering values only for the month of May.
INSERT INTO rentals_may (`rental_id`, `rental_date`, `inventory_id`, `customer_id`, `return_date`, `staff_id`, `last_update`)
SELECT `rental_id`, `rental_date`, `inventory_id`, `customer_id`, `return_date`, `staff_id`, `last_update` FROM rental
WHERE substring(rental_date,6,2) = '05';

SELECT 
    *
FROM
    rentals_may;

-- Create a table rentals_june to store the data from rental table with information for the month of June.
DROP TABLE IF EXISTS rentals_june;

CREATE TABLE rentals_june (
    `rental_id` INT NOT NULL,
    `rental_date` DATETIME NOT NULL,
    `inventory_id` MEDIUMINT UNSIGNED NOT NULL,
    `customer_id` SMALLINT UNSIGNED NOT NULL,
    `return_date` DATETIME DEFAULT NULL,
    `staff_id` TINYINT NOT NULL,
    `last_update` TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    CONSTRAINT PRIMARY KEY (`rental_id`)
);

-- Insert values in the table rentals_june using the table rental, filtering values only for the month of June.
INSERT INTO rentals_june (`rental_id`, `rental_date`, `inventory_id`, `customer_id`, `return_date`, `staff_id`, `last_update`)
SELECT `rental_id`, `rental_date`, `inventory_id`, `customer_id`, `return_date`, `staff_id`, `last_update` FROM rental
WHERE substring(rental_date,6,2) = '06';

SELECT 
    *
FROM
    rentals_june;

-- Check the number of rentals for each customer for May.
SELECT 
    customer_id, COUNT(customer_id) AS nb_rentals
FROM
    rentals_may
GROUP BY customer_id
ORDER BY COUNT(customer_id) DESC;

-- Check the number of rentals for each customer for June.
SELECT 
    customer_id, COUNT(customer_id) AS nb_rentals
FROM
    rentals_june
GROUP BY customer_id
ORDER BY COUNT(customer_id) DESC;

In [1]:
! pip install sqlalchemy
! pip install PyMySQL

Requirement already satisfied: sqlalchemy in /Users/vanchido/opt/anaconda3/lib/python3.9/site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in /Users/vanchido/opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy) (1.1.1)
Requirement already satisfied: PyMySQL in /Users/vanchido/opt/anaconda3/lib/python3.9/site-packages (1.0.2)

In [2]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass
password = getpass.getpass()

········

1. Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

- Check the number of rentals for each customer for May

- Check the number of rentals for each customer for June

Hint: You can store the results from the two queries in two separate dataframes.

2. Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

Hint: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the merge function.

In [3]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

rentals_may = pd.read_sql_query('SELECT * FROM rentals_may', engine)
rentals_may

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

In [4]:
rentals_june = pd.read_sql_query('SELECT * FROM rentals_june', engine)
rentals_june

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
2306,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
2307,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
2308,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
2309,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
2310,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

In [6]:
query_may = '''
            SELECT 
                customer_id, COUNT(customer_id) AS nb_rentals
            FROM
                rentals_may
            GROUP BY customer_id
            ORDER BY COUNT(customer_id) DESC;
            '''

rent_may = pd.read_sql_query(query_may, engine)
rent_may

     customer_id  nb_rentals
0            197           8
1            506           7
2            109           7
3            269           6
4            239           6
..           ...         ...
515          431           1
516          351           1
517           10           1
518          136           1
519           61           1

[520 rows x 2 columns]

In [7]:
query_june = '''
            SELECT 
                customer_id, COUNT(customer_id) AS nb_rentals
            FROM
                rentals_june
            GROUP BY customer_id
            ORDER BY COUNT(customer_id) DESC;
            '''

rent_june = pd.read_sql_query(query_june, engine)
rent_june

     customer_id  nb_rentals
0             31          11
1            454          10
2            329           9
3            295           9
4            561           9
..           ...         ...
585          425           1
586          412           1
587          335           1
588           22           1
589          126           1

[590 rows x 2 columns]

In [16]:
newdf = rent_june.merge(rent_may, how = 'inner', on = 'customer_id', suffixes = ['_june','_may'])
newdf

     customer_id  nb_rentals_june  nb_rentals_may
0            454               10               1
1            295                9               1
2            561                9               2
3            526                9               3
4            267                9               3
..           ...              ...             ...
507          367                1               2
508          425                1               1
509          412                1               4
510           22                1               3
511          126                1               3

[512 rows x 3 columns]

In [21]:
import numpy as np

newdf['compare'] = np.where(newdf['nb_rentals_june'] >= newdf['nb_rentals_may'],'June','May')
newdf

     customer_id  nb_rentals_june  nb_rentals_may compare
0            454               10               1    June
1            295                9               1    June
2            561                9               2    June
3            526                9               3    June
4            267                9               3    June
..           ...              ...             ...     ...
507          367                1               2     May
508          425                1               1    June
509          412                1               4     May
510           22                1               3     May
511          126                1               3     May

[512 rows x 4 columns]

In [26]:
june = newdf[newdf['compare']=='June']['customer_id'].count()
may = newdf[newdf['compare']=='May']['customer_id'].count()
if may > june:
    print("Customers borrow more films in May")
if may < june:
    print("Customers borrow more films in June")
else:
    print("Customers borrow films equally in May and June")

Customers borrow more films in June